espressif/esp-protocols/examples/mqtt/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"
CONFIG_EXAMPLE_CONNECT_WIFI=n
CONFIG_EXAMPLE_CONNECT_ETHERNET=y
